# Dependencies / Modules

In [1]:
### TODO: remove unnecessary modules

import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

import geopandas as gpd

from sklearn.neighbors import LocalOutlierFactor
from sklearn.ensemble import IsolationForest, RandomForestClassifier
from sklearn.decomposition import PCA
from sklearn.preprocessing import StandardScaler,  RobustScaler
from sklearn.pipeline import Pipeline
from sklearn.model_selection import train_test_split
from sklearn.metrics import classification_report, confusion_matrix, accuracy_score

import warnings
warnings.filterwarnings("ignore")

# Grabing the data

In [2]:
# Athlete Events
df_athlete_events = pd.read_csv('../data/athlete_events.csv')

# NOC (National Olympic Comitee) Regions
df_noc_regions    = pd.read_csv('../data/noc_regions.csv')

# World Gross Domestic Product
df_world_gdp      = pd.read_csv('../data/world_gdp.csv')

# World Population
df_world_pop      = pd.read_csv('../data/world_pop.csv')

# World Cities
df_world_cities   = pd.read_csv('../data/worldcities.csv')

# GeoJSON
df_geo_json       = gpd.read_file('../data/countries.geojson')

# Look into the created data frames

## ~Athlete Events

In [3]:
# Athlete Events
df_athlete_events.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [4]:
### Notice the following:
# 'Name' and 'ID' are NOT NEEDED for prediction
# Drop 'NOC' in favor of 'Team'
# Drop 'Games' as this information is already in 'Year' and 'Season'

df_athlete_events = df_athlete_events.drop(columns=['Name', 'ID', 'NOC', 'Games'])
df_athlete_events.head()

,Sex,Age,Height,Weight,Team,Year,Season,City,Sport,Event,Medal
0,M,24.0,180.0,80.0,China,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,M,23.0,170.0,60.0,China,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,M,24.0,NaN,NaN,Denmark,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,M,34.0,NaN,NaN,Denmark/Sweden,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,F,21.0,185.0,82.0,Netherlands,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [5]:
df_athlete_events.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271116 entries, 0 to 271115
Data columns (total 11 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   Sex     271116 non-null  object
 1   Age     261642 non-null  float64
 2   Height  210945 non-null  float64
 3   Weight  208241 non-null  float64
 4   Team    271116 non-null  object
 5   Year    271116 non-null  int64
 6   Season  271116 non-null  object
 7   City    271116 non-null  object
 8   Sport   271116 non-null  object
 9   Event   271116 non-null  object
 10  Medal   39783 non-null   object
dtypes: float64(3), int64(1), object(7)
memory usage: 22.8+ MB

## ~NOC (National Olympic Comitee) Regions

In [6]:
# NOC (National Olympic Comitee) Regions
df_noc_regions.head()

   NOC       region                 notes
0  AFG  Afghanistan                   NaN
1  AHO      Curacao  Netherlands Antilles
2  ALB      Albania                   NaN
3  ALG      Algeria                   NaN
4  AND      Andorra                   NaN

In [7]:
df_noc_regions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 230 entries, 0 to 229
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   NOC     230 non-null    object
 1   region  227 non-null    object
 2   notes   21 non-null     object
dtypes: object(3)
memory usage: 5.5+ KB

## ~World Gross Domestic Product

In [8]:
# World Gross Domestic Product
df_world_gdp.head()

,Data Source,World Development Indicators,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 51,Unnamed: 52,Unnamed: 53,Unnamed: 54,Unnamed: 55,Unnamed: 56,Unnamed: 57,Unnamed: 58,Unnamed: 59,Unnamed: 60
0,Last Updated Date,1/25/2018,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Country Name,Country Code,Indicator Name,Indicator Code,1960.0,1961.0,1962.0,1963.0,1964.0,1.965000e+03,...,2.007000e+03,2.008000e+03,2.009000e+03,2.010000e+03,2.011000e+03,2.012000e+03,2.013000e+03,2.014000e+03,2.015000e+03,2.016000e+03
3,Afghanistan,AFG,GDP (current US$),NY.GDP.MKTP.CD,537777811.0,548888896.0,546666678.0,751111191.0,800000044.0,1.006667e+09,...,9.843842e+09,1.019053e+10,1.248694e+10,1.593680e+10,1.793024e+10,2.053654e+10,2.004633e+10,2.005019e+10,1.921556e+10,1.946902e+10
4,Albania,ALB,GDP (current US$),NY.GDP.MKTP.CD,NaN,NaN,NaN,NaN,NaN,NaN,...,1.070101e+10,1.288135e+10,1.204421e+10,1.192695e+10,1.289087e+10,1.231978e+10,1.277628e+10,1.322824e+10,1.133526e+10,1.186387e+10

In [9]:
df_world_gdp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 222 entries, 0 to 221
Data columns (total 61 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   Data Source                   221 non-null    object
 1   World Development Indicators  221 non-null    object
 2   Unnamed: 2                    220 non-null    object
 3   Unnamed: 3                    220 non-null    object
 4   Unnamed: 4                    103 non-null    float64
 5   Unnamed: 5                    103 non-null    float64
 6   Unnamed: 6                    105 non-null    float64
 7   Unnamed: 7                    105 non-null    float64
 8   Unnamed: 8                    105 non-null    float64
 9   Unnamed: 9                    114 non-null    float64
 10  Unnamed: 10                   115 non-null    float64
 11  Unnamed: 11                   118 non-null    float64
 12  Unnamed: 12                   120 non-null    float64
 13  Unnamed: 13                   120 non-null    float64
 14  Unnamed: 14                   127 non-null    float64
 15  Unnamed: 15                   129 non-null    float64
 16  Unnamed: 16                   129 non-null    float64
 17  Unnamed: 17                   129 non-null    float64
 18  Unnamed: 18                   129 non-null    float64
 19  Unnamed: 19                   131 non-null    float64
 20  Unnamed: 20                   132 non-null    float64
 21  Unnamed: 21                   136 non-null    float64
 22  Unnamed: 22                   135 non-null    float64
 23  Unnamed: 23                   136 non-null    float64
 24  Unnamed: 24                   146 non-null    float64
 25  Unnamed: 25                   149 non-null    float64
 26  Unnamed: 26                   150 non-null    float64
 27  Unnamed: 27                   151 non-null    float64
 28  Unnamed: 28                   152 non-null    float64
 29  Unnamed: 29                   155 non-null    float64
 30  Unnamed: 30                   156 non-null    float64
 31  Unnamed: 31                   160 non-null    float64
 32  Unnamed: 32                   162 non-null    float64
 33  Unnamed: 33                   164 non-null    float64
 34  Unnamed: 34                   181 non-null    float64
 35  Unnamed: 35                   181 non-null    float64
 36  Unnamed: 36                   182 non-null    float64
 37  Unnamed: 37                   184 non-null    float64
 38  Unnamed: 38                   186 non-null    float64
 39  Unnamed: 39                   194 non-null    float64
 40  Unnamed: 40                   195 non-null    float64
 41  Unnamed: 41                   194 non-null    float64
 42  Unnamed: 42                   196 non-null    float64
 43  Unnamed: 43                   197 non-null    float64
 44  Unnamed: 44                   201 non-null    float64
 45  Unnamed: 45                   201 non-null    float64
 46  Unnamed: 46                   205 non-null    float64
 47  Unnamed: 47                   205 non-null    float64
 48  Unnamed: 48                   206 non-null    float64
 49  Unnamed: 49                   206 non-null    float64
 50  Unnamed: 50                   207 non-null    float64
 51  Unnamed: 51                   207 non-null    float64
 52  Unnamed: 52                   206 non-null    float64
 53  Unnamed: 53                   205 non-null    float64
 54  Unnamed: 54                   206 non-null    float64
 55  Unnamed: 55                   206 non-null    float64
 56  Unnamed: 56                   202 non-null    float64
 57  Unnamed: 57                   203 non-null    float64
 58  Unnamed: 58                   201 non-null    float64
 59  Unnamed: 59                   200 non-null    float64
 60  Unnamed: 60                   192 non-null    float64
dtypes: float64(57), object(4)
memory usage: 105.9+ KB

## ~World Population

In [10]:
# World Population
df_world_pop.head()

,Country,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016
0,Aruba,ABW,"Population, total",SP.POP.TOTL,54211.0,55438.0,56225.0,56695.0,57032.0,57360.0,...,101220.0,101353.0,101453.0,101669.0,102053.0,102577.0,103187.0,103795.0,104341.0,104822
1,Afghanistan,AFG,"Population, total",SP.POP.TOTL,8996351.0,9166764.0,9345868.0,9533954.0,9731361.0,9938414.0,...,26616792.0,27294031.0,28004331.0,28803167.0,29708599.0,30696958.0,31731688.0,32758020.0,33736494.0,34656032
2,Angola,AGO,"Population, total",SP.POP.TOTL,5643182.0,5753024.0,5866061.0,5980417.0,6093321.0,6203299.0,...,20997687.0,21759420.0,22549547.0,23369131.0,24218565.0,25096150.0,25998340.0,26920466.0,27859305.0,28813463
3,Albania,ALB,"Population, total",SP.POP.TOTL,1608800.0,1659800.0,1711319.0,1762621.0,1814135.0,1864791.0,...,2970017.0,2947314.0,2927519.0,2913021.0,2905195.0,2900401.0,2895092.0,2889104.0,2880703.0,2876101
4,Andorra,AND,"Population, total",SP.POP.TOTL,13411.0,14375.0,15370.0,16412.0,17469.0,18549.0,...,82683.0,83861.0,84462.0,84449.0,83751.0,82431.0,80788.0,79223.0,78014.0,77281

In [11]:
df_world_pop.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 217 entries, 0 to 216
Data columns (total 61 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Country         217 non-null    object
 1   Country Code    217 non-null    object
 2   Indicator Name  217 non-null    object
 3   Indicator Code  217 non-null    object
 4   1960            214 non-null    float64
 5   1961            214 non-null    float64
 6   1962            214 non-null    float64
 7   1963            214 non-null    float64
 8   1964            214 non-null    float64
 9   1965            214 non-null    float64
 10  1966            214 non-null    float64
 11  1967            214 non-null    float64
 12  1968            214 non-null    float64
 13  1969            214 non-null    float64
 14  1970            214 non-null    float64
 15  1971            214 non-null    float64
 16  1972            214 non-null    float64
 17  1973            214 non-null    float64
 18  1974            214 non-null    float64
 19  1975            214 non-null    float64
 20  1976            214 non-null    float64
 21  1977            214 non-null    float64
 22  1978            214 non-null    float64
 23  1979            214 non-null    float64
 24  1980            214 non-null    float64
 25  1981            214 non-null    float64
 26  1982            214 non-null    float64
 27  1983            214 non-null    float64
 28  1984            214 non-null    float64
 29  1985            214 non-null    float64
 30  1986            214 non-null    float64
 31  1987            214 non-null    float64
 32  1988            214 non-null    float64
 33  1989            214 non-null    float64
 34  1990            216 non-null    float64
 35  1991            216 non-null    float64
 36  1992            215 non-null    float64
 37  1993            215 non-null    float64
 38  1994            215 non-null    float64
 39  1995            216 non-null    float64
 40  1996            216 non-null    float64
 41  1997            216 non-null    float64
 42  1998            217 non-null    int64
 43  1999            217 non-null    int64
 44  2000            217 non-null    int64
 45  2001            217 non-null    int64
 46  2002            217 non-null    float64
 47  2003            217 non-null    float64
 48  2004            217 non-null    float64
 49  2005            217 non-null    float64
 50  2006            217 non-null    float64
 51  2007            217 non-null    float64
 52  2008            217 non-null    float64
 53  2009            217 non-null    float64
 54  2010            217 non-null    float64
 55  2011            217 non-null    float64
 56  2012            217 non-null    float64
 57  2013            217 non-null    float64
 58  2014            217 non-null    float64
 59  2015            217 non-null    float64
 60  2016            217 non-null    int64
dtypes: float64(52), int64(5), object(4)
memory usage: 103.5+ KB

## ~World Cities

In [12]:
# World Cities
df_world_cities.head()

,city,city_ascii,lat,lng,country,iso2,iso3,admin_name,capital,population,id
0,Tokyo,Tokyo,35.6839,139.7744,Japan,JP,JPN,Tōkyō,primary,39105000.0,1392685764
1,Jakarta,Jakarta,-6.2146,106.8451,Indonesia,ID,IDN,Jakarta,primary,35362000.0,1360771077
2,Delhi,Delhi,28.6667,77.2167,India,IN,IND,Delhi,admin,31870000.0,1356872604
3,Manila,Manila,14.6000,120.9833,Philippines,PH,PHL,Manila,primary,23971000.0,1608618140
4,São Paulo,Sao Paulo,-23.5504,-46.6339,Brazil,BR,BRA,São Paulo,admin,22495000.0,1076532519

In [13]:
df_world_cities.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 42905 entries, 0 to 42904
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   city        42905 non-null  object
 1   city_ascii  42905 non-null  object
 2   lat         42905 non-null  float64
 3   lng         42905 non-null  float64
 4   country     42905 non-null  object
 5   iso2        42873 non-null  object
 6   iso3        42905 non-null  object
 7   admin_name  42810 non-null  object
 8   capital     9812 non-null   object
 9   population  42180 non-null  float64
 10  id          42905 non-null  int64
dtypes: float64(3), int64(1), object(7)
memory usage: 3.6+ MB

## ~Geo JSON

In [17]:
# GeoJSON
df_geo_json.head()

         ADMIN ISO_A3                                           geometry
0        Aruba    ABW  POLYGON ((-69.99694 12.57758, -69.93639 12.531...
1  Afghanistan    AFG  POLYGON ((71.04980 38.40866, 71.05714 38.40903...
2       Angola    AGO  MULTIPOLYGON (((11.73752 -16.69258, 11.73851 -...
3     Anguilla    AIA  MULTIPOLYGON (((-63.03767 18.21296, -63.09952 ...
4      Albania    ALB  POLYGON ((19.74777 42.57890, 19.74601 42.57993...

In [15]:
df_geo_json.info()

<class 'geopandas.geodataframe.GeoDataFrame'>
RangeIndex: 255 entries, 0 to 254
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   ADMIN     255 non-null    object
 1   ISO_A3    255 non-null    object
 2   geometry  255 non-null    geometry
dtypes: geometry(1), object(2)
memory usage: 6.1+ KB

# Create more data frames containing necessary and/or needed and/or important data

## ~Participants which won a medal

In [20]:
# Create data frame containing data about participants which actually have won a medal
df_medal_won = df_athlete_events[~df_athlete_events['Medal'].isnull()]
df_medal_won

,Sex,Age,Height,Weight,Team,Year,Season,City,Sport,Event,Medal
3,M,34.0,NaN,NaN,Denmark/Sweden,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
37,M,30.0,NaN,NaN,Finland,1920,Summer,Antwerpen,Swimming,Swimming Men's 200 metres Breaststroke,Bronze
38,M,30.0,NaN,NaN,Finland,1920,Summer,Antwerpen,Swimming,Swimming Men's 400 metres Breaststroke,Bronze
40,M,28.0,184.0,85.0,Finland,2014,Winter,Sochi,Ice Hockey,Ice Hockey Men's Ice Hockey,Bronze
41,M,28.0,175.0,64.0,Finland,1948,Summer,London,Gymnastics,Gymnastics Men's Individual All-Around,Bronze
...,...,...,...,...,...,...,...,...,...,...,...
271078,F,25.0,168.0,80.0,Soviet Union,1956,Summer,Melbourne,Athletics,Athletics Women's Shot Put,Silver
271080,F,33.0,168.0,80.0,Soviet Union,1964,Summer,Tokyo,Athletics,Athletics Women's Shot Put,Bronze
271082,M,28.0,182.0,82.0,Poland,1980,Summer,Moskva,Fencing,"Fencing Men's Foil, Team",Bronze
271102,F,19.0,171.0,64.0,Russia,2000,Summer,Sydney,Athletics,Athletics Women's 4 x 400 metres Relay,Bronze
271103,F,23.0,171.0,64.0,Russia,2004,Summer,Athina,Athletics,Athletics Women's 4 x 400 metres Relay,Silver